[
  {
    "id": 1,
    "sortInfo": "A powerful narrative about the life of Okonkwo, a leader in a Nigerian village, and the impact of colonialism on traditional African society.",
    "description": "Chinua Achebe's Things Fall Apart is a groundbreaking novel that tells the story of Okonkwo, a proud and powerful leader in a Nigerian village, and the impact of colonialism on his community. Set in the late 19th century, the novel explores themes of tradition, change, and cultural conflict. Achebe's portrayal of pre-colonial Igbo society and his critique of European imperialism have made Things Fall Apart a seminal work in African literature and a powerful voice in postcolonial discourse.",
    "author": "Chinua Achebe",
    "country": "Nigeria",
    "img": "https://i.ibb.co.com/GQwXyXr4/Things-Fall-Apart.gif",
    "language": "English",
    "pages": 209,
    "title": "Things Fall Apart",
    "year": 1958,
    "rating": 4.5,
    "category": "Fiction"
  },
  {
    "id": 2,
    "sortInfo": "A collection of timeless fairy tales that have captivated children and adults alike with their magical stories and moral lessons.",
    "description": "Hans Christian Andersen's Fairy Tales is a collection of enchanting stories that have captivated readers of all ages. From The Little Mermaid to The Ugly Duckling, Andersen's tales blend whimsy, moral lessons, and emotional depth. Unlike traditional folk tales, Andersen's stories often feature original characters and themes, reflecting his unique imagination and sensitivity to the human condition. These timeless tales continue to inspire adaptations and remain a cornerstone of children's literature worldwide.",
    "author": "Hans Christian Andersen",
    "country": "Denmark",
    "img": "https://i.ibb.co.com/m56RG5jp/fiary-Tail.jpg",
    "language": "Danish",
    "pages": 784,
    "title": "Fairy tales",
    "year": 1836,
    "rating": 4.7,
    "category": "Fiction"
  },
  {
    "id": 3,
    "sortInfo": "An epic poem that takes the reader on a journey through Hell, Purgatory, and Paradise, exploring themes of redemption and divine justice.",
    "description": "Dante Alighieri's The Divine Comedy is an epic poem that takes readers on a journey through Hell (Inferno), Purgatory (Purgatorio), and Paradise (Paradiso). Guided by the Roman poet Virgil and his beloved Beatrice, Dante explores themes of sin, redemption, and divine justice. Written in the early 14th century, the poem is a masterpiece of Italian literature and a profound reflection on the human soul's journey toward God. Its vivid imagery, allegorical depth, and theological insights have cemented its place as one of the greatest works of world literature.",
    "author": "Dante Alighieri",
    "country": "Italy",
    "img": "https://i.ibb.co.com/Hp209ZrR/The-Divine-Comedy.jpg",
    "language": "Italian",
    "pages": 928,
    "title": "The Divine Comedy",
    "year": 1315,
    "rating": 4.8,
    "category": "Poetry"
  },
  {
    "id": 4,
    "sortInfo": "One of the earliest known works of literature, this epic poem tells the story of Gilgamesh, a king seeking immortality, and explores themes of friendship and mortality.",
    "description": "The Epic of Gilgamesh is one of the oldest known works of literature, dating back to ancient Mesopotamia. It tells the story of Gilgamesh, a powerful king who embarks on a quest for immortality after the death of his friend Enkidu. The epic explores themes of friendship, mortality, and the search for meaning in life. Its rich mythological elements and universal themes have made it a foundational text in world literature, offering insights into the values and beliefs of early human civilizations.",
    "author": "Sîn-lēqi-unninni", 
    "country": "Sumer and Akkadian Empire",
    "img": "https://i.ibb.co.com/QjKRycWm/The-Epic-Of-Gilgamesh.jpg",
    "language": "Akkadian",
    "pages": 160,
    "title": "The Epic Of Gilgamesh",
    "year": 1700,
    "rating": 4.6,
    "category": "Poetry"
  },
  {
    "id": 5,
    "sortInfo": "A profound exploration of human suffering and faith, this biblical book tells the story of Job, a man tested by God.",
    "description": "The Book of Job is a profound biblical text that explores themes of human suffering, faith, and divine justice. It tells the story of Job, a righteous man who endures immense suffering as his faith is tested by God and challenged by his friends. Through poetic dialogues and philosophical debates, the book grapples with the problem of evil and the nature of God's will. Its timeless questions about suffering and the human condition continue to resonate with readers across cultures and religions.",
    "author": "Traditional attribution: Moses",
    "country": "Achaemenid Empire",
    "img": "https://i.ibb.co.com/TDbZPxB4/The-Book-Of-Job.jpg",
    "language": "Hebrew",
    "pages": 176,
    "title": "The Book Of Job",
    "year": 1600,
    "rating": 4.4,
    "category": "Non-Fiction"
  },
  {
    "id": 6,
    "sortInfo": "A collection of Middle Eastern folk tales narrated by Scheherazade, filled with adventure, romance, and fantasy.",
    "description": "One Thousand and One Nights is a collection of Middle Eastern folk tales compiled over centuries. Framed by the story of Scheherazade, a clever queen who tells her husband, King Shahryar, a new story each night to delay her execution, the tales include iconic stories like Aladdin, Ali Baba, and Sinbad the Sailor. Filled with adventure, romance, magic, and moral lessons, the collection reflects the rich cultural heritage of the Islamic Golden Age and has influenced global literature and storytelling traditions.",
    "author": "Various Authors (Compiled by Anonymous)", 
    "country": "India/Iran/Iraq/Egypt/Tajikistan",
    "img": "https://i.ibb.co.com/nMS5JSsh/One-Thousandand-One-Nights.jpg",
    "language": "Arabic",
    "pages": 288,
    "title": "One Thousand and One Nights",
    "year": 1200,
    "rating": 4.5,
    "category": "Fiction"
  },
  {
    "id": 7,
    "sortInfo": "An Icelandic saga that recounts the tragic feud between two families, exploring themes of honor, revenge, and fate.",
    "description": "The Sagas of Icelanders are a collection of medieval Icelandic prose narratives that recount the lives, struggles, and adventures of early Norse settlers in Iceland. Written in the 13th and 14th centuries, these sagas blend history, myth, and folklore, offering a vivid portrayal of Viking-age society. Themes of honor, revenge, fate, and family loyalty dominate these tales, which are celebrated for their rich storytelling and complex characters. The sagas provide a unique window into the cultural and social fabric of medieval Iceland.",
    "author": "Snorri Sturluson (Attributed)", 
    "country": "Iceland",
    "img": "https://i.ibb.co.com/NdKmT7bF/the-Sagas-Of-Icelanoers.jpg",
    "language": "Old Norse",
    "pages": 384,
    "title": "the sagas of icelanders",
    "year": 1350,
    "rating": 4.3,
    "category": "Fiction"
  },
  {
    "id": 8,
    "sortInfo": "A classic romance novel that explores themes of love, class, and reputation through the story of Elizabeth Bennet and Mr. Darcy.",
    "description": "Jane Austen's Pride and Prejudice is a timeless romance novel set in 19th-century England. It follows Elizabeth Bennet, a sharp-witted and independent young woman, as she navigates societal expectations, family pressures, and her evolving feelings for the enigmatic Mr. Darcy. The novel explores themes of love, class, and reputation, offering a witty critique of the rigid social norms of the time. With its memorable characters, sparkling dialogue, and enduring exploration of human relationships, Pride and Prejudice remains one of the most beloved works in English literature.",
    "author": "Jane Austen",
    "country": "United Kingdom",
    "img": "https://i.ibb.co.com/1Jhqn73d/Prideand-Prejudice.jpg",
    "language": "English",
    "pages": 226,
    "title": "Pride and Prejudice",
    "year": 1813,
    "rating": 4.7,
    "category": "Fiction"
  },
  {
    "id": 9,
    "sortInfo": "A dark and cynical novel that follows the journey of a disillusioned man through a world filled with corruption and despair.",
    "description": "Journey to the End of the Night is a dark and cynical novel by French author Louis-Ferdinand Céline, first published in 1932. It follows the life of Ferdinand Bardamu, a disillusioned and anti-heroic protagonist, as he navigates a world filled with corruption, violence, and despair. The novel takes readers through Bardamu's experiences in World War I, colonial Africa, and industrialized America, before returning to France, where he works as a doctor in a poor suburb. Céline's raw, fragmented prose and bleak worldview challenge traditional literary conventions, offering a scathing critique of modern society. The book is celebrated for its innovative style and unflinching exploration of human suffering and existential despair.",
    "author": "Louis-Ferdinand Céline",
    "country": "France",
    "img": "https://i.ibb.co.com/N6rZhj0T/Journey-To-The-Endof-The-Night.jpg",
    "language": "French",
    "pages": 505,
    "title": "Journey to the End of the Night",
    "year": 1932,
    "rating": 4.2,
    "category": "Fiction"
  }
]